example/query/Poll_event_single_param_advanced/HASATTR_fieldname.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:query="urn:epcglobal:epcis-query:xsd:1" xmlns:xsd="http://www.w3.org/2001/XMLSchema"
                  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Header/>
    <soapenv:Body>
        <query:Poll>
            <queryName>SimpleEventQuery</queryName>
            <params>
                <param>
                    <name>HASATTR_bizLocation</name>
                    <value xsi:type="query:ArrayOfString">
                        <string>urn:epc:id:sgln:0037000.00729.0</string>
                    </value>
                </param>
            </params>
        </query:Poll>
    </soapenv:Body>
</soapenv:Envelope>